如何看待马云 2019年4月11日在内外直播中将 996 称为「修来的福报」？


这些话给我看的气笑了。
真是聪明人，一堆诡辩，用煽情的口吻一溜说出来，能把人唬的一愣一愣的。
来学习一下话术吧

Q：如果你年轻的时候不996，你什么时候可以996？
陷阱：不问你要不要996，直接让你选时候996.
类似问你“你是早饭在这吃还是晚饭在这吃”，直接跳过了关键：“我为啥要在这吃饭，我去别处吃不行么？”——为啥996非得选时候，我也可以不996吧？
依此逻辑延伸：“如果你年轻的时候不吃shit，你什么时候可以吃shit “

Q：你一辈子没有996，你觉得你就很骄傲了？
陷阱：走另一个极端来反问。可是磨砂不了996的价值，并不能证明996是合理的呀，何况996还未发......一辈子不996的确没啥骄傲的，但一辈子每天996，又有啥值得骄傲的？以及，怎么996就跟骄傲与否挂钩了？
依此逻辑延伸："你一辈子没吃过shit，你觉得你就很骄傲了？"——>“不吃屎没啥可骄傲的”，但并不能因此推导出“大家可以考虑吃一下shit”的正当性吧

Q：这个世界上，我们每一个人都希望成功，都希望美好生活，都希望被尊重，我请问阿加，你不付出超越别人的努力和时间，你怎么能够实现你想要的成功？
陷阱：将996这种违法超额劳动，美化为“付出超越别人的努力和时间”，并直接与“想要的成功”挂钩。
依此逻辑延伸：“我们每个人都希望美好生活，我请问加大家，你不付出超越别人的努力和时间去抢劫砍人，你怎么能实现你想要的成功？”于是兄弟们就热血沸腾手舞西瓜刀出发了？

Q：所以今天中国BAT这些公司能够996，我认为是我们这些人修来的福报。你去想一下没有工作的人，你去想一下公司明天可能要关门的人，你去想想下一个季度公司的Revenue在哪里都还不知道的人，你去想想你做了很多努力的程序根本没有人用的人......跟他们比，直到今天，我依然这么觉得，我很幸运，我没有后悔12x12，我从没有改变过自己这一点。
陷阱：强行跟更惨比惨
依此逻辑延伸：“人要往下看，你会活的很快乐。我想了想 ，他说得有道理。人活着就是这样，你老往上看，你好不了，非死不可，往下瞧，你做买卖你赔钱了？那还有跳楼的呢，跟他比你很快乐。你生闺女恨得慌，那还有没孩子的呢。你这失业了，那还有连失身的呢！”
——郭德纲班主的某段子，但人家是段子啊！

Q：今天我们拥有这么多资源，我们带着巨大的使命，希望在未来能够让天下没有难做的生意，你不付出可以吗？不可以
陷阱：将企业盈利机构的商业目的，强行扭曲成使命和义务（就是不肯谈涨工钱）；将不肯违法996，说成“不付出”（就是不肯谈涨工钱）
工作是挣钱的事，怎么就搞得跟公益似的谈“付出”了？以及，既然有这么多的资源，能不能直接点，多谈谈加班工资呢？

Q：我希望阿里人热爱你做的工作，如果你不热爱，哪怕8小时你都嫌很长，如果你热爱，12个小时不算太长。
陷阱：将是否肯996余是否热爱工作强行挂钩。并用“12小时”来强行定义“热爱工作”。瞧瞧抹掉了996超额违法劳动的事实。
依次逻辑延伸：“你不爱我，给我买8000元的手机都不肯；你爱我，给我买一万二的手机都不嫌贵”——所以这是...在撒娇？

Q：但是我最希望考虑的，是你在阿里待10年，我们怎么样把你变成一个不同的人。一年内发生变化，三年内发生变化，你回去，你爸妈发现你这个孩子变了，你老婆发现我老公怎么变得这么有理想了，有想法了，开始专注工作了，你孩子觉得爸爸妈妈跟人家就是不一样。这是我们所希望的阿里人个人的成长，这个成长不是职位做的多大，而是你对问题的看法，你遇上的困难态度，你对人生的态度。
陷阱：将996超额劳工与“变成一个不同的人”强行挂钩
所以，996是培养一个人对问题的看法，对困难的态度呢？超额工作是如何让人变得更有理想更专注工作呢？这里头有啥必要逻辑吗？
有没有可能长期996后，老婆发现的不是老公变得有理想专注工作，而是疲惫了脱发了眼花了胆囊差了？为什么不能说，那些甘愿996的人最显著的变化是“我肯996，肯为了工作放弃其他，你们可以尽情使唤我，虽然我身体因为996也不大好了”呢？为什么说的996像是让人脱胎换骨的特训呢？
最后还来个“成长不是职位做的多大”，嗯，难道不是应该直接许诺，超额工作=升值吗？现在变成了：你996了就会有好变化——但不一定升职。
类似于“你买了我这药吃了，虽然身体机能不会有任何数据上的变化，但你会觉得自己变牛了哟！”

总之：模糊重点，偷换概念，将违反劳动法超额工作996与成功成长等强行挂钩。

用热爱，福气，社会责任，奋斗，骄傲等抒情虚词，掩盖酬劳，工时，权责这些实际切身利益补偿——哪怕直接说“996的人我们都要给高额加班费”，“996最积极的人我们保证升职”，都比较实在。又要马儿跑，还不给马吃草。

用自己的奋斗来距离，忽悠员工们奋斗，忽略不提“资方”与“劳方”所得差异

用以来年化其实并无严格逻辑可言的话术，一气呵成地吐出，达到煽情鼓动目的。

技巧非常熟练呀。


Q：也正因为有这样一群人的996，997，才让上世纪我们有了“两弹一星”，才让我们的国家在过去短短的四十年取得了举世瞩目的成就，才会有“神五”“神六”，才让我们对未来有了信心
这政治觉悟我真是服了，杀人诛心啊
马总把国家搬了出来，把我们过去的成就一股脑儿的和996划上等号，似乎我们正是有了各行各业的996，才能在短时间内弯道超车，取得了今天的瞩目成绩
既然如此，法律又算得了什么呢？毕竟在奉献面前，谈劳动法就太伤感情了
重新看了看福报那几句话，每句话分开来看很煽情很热血。连起来看，有点奇怪

Q：所以今天中国BAT这些公司能够996，我认为是我们这些人修来的福报
福报一般来说，该是善业善报。这个概念可以回溯到印度教的业力：你好好牺牲奉献，就能转世到高级种姓比如婆罗门；你不好好地牺牲奉献，就会转世去当低级种姓......这最初本是用来让印度人忽视已有的等级差异，老老实实埋头干活的。
好这话题扯远了，大家明白就行，现在疑问是：
把“公司能够996”说成是福报，听来感觉不大对？......人家白素贞千年修得人身遇许仙，心满意足，这是福报；您这里“修来的福报”，却是要大家超额工作加班加点？
照这个逻辑，拉美的香蕉园最有福报了：人家全年无休地榨人呢......

好既然前面说了996是大家修来的福报，那么看全文最后
Q：但是我想你们应该有这个理想，在阿里工作10年，15年，有一天可以建立一个自己的公益基金，可以做一些愿意做的事情，能够帮助你的孩子更有福报，帮助你自己有福报，不是一件很好的事情吗？这就需要996

所以说，996=福报，大家一起996，最后得到了什么？世世代代子子孙孙无穷匮也的996么？
却又说需要996是为了有一天，大家和孩子有更多的福报，可以做一些愿意做的事情
是不是有点前后矛盾么
是不是老板明知道996是苦差，却在前面强行把996夸成是福报，后面描绘美好未来的时候，却又不慎说了心里话

那么，按照本讲话的逻辑：996究竟是福报还是受苦

我也被搞糊涂了

这就是一张超级大饼

周樟寿，周树人，周豫山，周豫才，鲁迅 都曾经说过
“我翻开历史一查，这历史没有年代，歪歪斜斜的每页上都写着‘仁义道德’四个字。我横竖睡不着，仔细看了半夜，才从字缝里看出字来，满本都写着两个字是‘吃人’！”


————————————转自知乎 张佳玮
