0.如果软件正在占领全世界，为什么程序员得不到尊重?
    遍身罗绮者，不是养蚕人。
1.中国大陆的盗版Windows系统都是怎么做出来的?
    复制、粘贴。
2.中国梦和美国梦的区别是什么?
    中国梦.txt，美国梦.exe
3.请用最简洁的语言描述我国fa lv。
    754
4.哪种编程能够永生?
    除非你能一直续。
5.怎么翻译Linus Torvalds的这句「Talk is cheap. Show me the code」比较好?
    屁话少说，放码过来。
6.Google Glass的启动命令：OK，Glass，中文翻译为什么最合适?
    好的，镜哥哥。
7.什么是递归?
    古之欲明明德于天下者，先治其国；欲治其国者，先齐其家；欲齐其家者，先修其身；欲修其身者，先正其心；欲正其心者，先诚其意；欲诚其意者，先致其知，致知在格物。物格而后知至，知至而后意诚，意诚而后心正，心正而后身修，身修而后家齐，家齐而后国治，国治而后天下平。
8.你见过最烂的设计是什么?
    正反面永远一次插不对的 usb 接口设计
9.哪款键盘用起来手感比较好?
    这款。<img src="https://pic4.zhimg.com/v2-05b229f02256053ffb3b1e0b160429cb_b.jpg" data-caption="" data-size="normal" data-rawwidth="511" data-rawheight="345" class="origin_image zh-lightbox-thumb" width="511" data-original="https://pic4.zhimg.com/v2-05b229f02256053ffb3b1e0b160429cb_r.jpg">
10.作为一个程序员，自己的女票比自己代码力强是一种什么样的体验?
    <img src="https://pic4.zhimg.com/v2-e5605eede49e258a1c2cf7dad7898e8f_b.jpg" data-caption="" data-size="normal" data-rawwidth="390" data-rawheight="438" class="content_image" width="390">
11.如果你是图灵测试者，你会问机器什么问题?
    金坷垃好处都有啥?
12.作为IT人员，你觉得什么工具能大大提高你的工作效率?
    单身。
13.Android上能提高学习、工作效率的应用有哪些?
    关机。
14.在网吧写代码是怎样一种体验?
    装完开发环境，重启，没了。
15.为什么很多程序员、geek 都喜欢熬夜，而且在后半夜工作效率异常高?一个姑娘问我，搞学术的为什么都睡得那么晚，难道只有到晚上才有灵感?
    不是，姑娘，搞学术不靠灵感，靠的是碌碌无为的白天引发的愧疚心。程序员、Geek 们也是这样。
16.单身程序狗解决了一个技术难题后没有妹子可以炫耀或夸一下自己怎么办?
    现在你明白了吧，为什么那么多程序员要写技术博客。
17.有哪些老鸟程序员知道而新手不知道的小技巧?
    程序不等于数据结构加算法，而等于搜索引擎加英语。
18.程序员的核心竞争力是什么?为什么?
    “玩算法的码农，打拼靠蓝条，像是法师。数学就等于蓝条最大值，数学差，魔法值不高，很快就到瓶颈了。外语影响回蓝速度。经验和智力加急速和穿透的。不玩算法的码农，像是战士，打拼靠血条，体质加生命，精神加生命回复，经验和敏捷加急速和破甲。”
19.IT大牛是怎样炼成的?记得初入公司时，写的代码乱七八糟，错误百出，bug连连，不仅项目经理骂我，其他同事也对我怨声载道。后来听朋友介绍，就报了一个培训班。经过1个月的刻苦学习，终于功夫不负有心人—他们都骂不过我了。
20.会写脚本的程序员如何去阿里工作?
    告诉面试官，我不吃月饼。生活相关
21.码农们最常说的谎言是什么?
    // TODO22. 程序员的优越感从何而来?感觉码农写代码并没有比修自行车高贵，那么为什么他们这么吊炸天?码农也是你们叫的?
23.你有哪些用计算机技能解决生活问题的经历?
    (1)我认识一个大牛，他不喜欢洗袜子，又不喜欢袜子的臭味。他买了很多样式一样的袜子，把这些袜子放在地上，根据臭的程度，摆一个二叉堆。每天早上，他pop两只最“香”的袜子，穿上；晚上回到家，把袜子脱下来，push到堆里。某一天，top的袜子超过他的耐臭能力，全扔掉，买新的。
    (2)写个死循环把笔记本的CPU和GPU占满，把出风口当吹风机吹头。
24.突然想开一家程序员主题的餐馆，名字就叫程序员的菜，菜名就叫各种语言中的关键字，各位指点一哈，有前途没?
    北京西直门嘉茂广场外面有很大一个招牌“mysql”,当年我就是好奇这家餐厅和“mysql”到底有啥关系才去这家韩国餐厅的，结果服务员告诉我那是“明月三千里”的缩写，我有种被忽悠的赶脚。
25.如何让别人明白「学习或从事计算机专业的人不一定会修电脑」?
    我是学法学的是不是要搓个火球给你看阿?
26.如何反驳「程序员离开电脑就是废物」这个观点?
    不不不，很多程序员在电脑前也是废物。
27.为什么程序员无论到哪儿都喜欢背电脑包，哪怕里面没有装电脑?
    因为他们没有别的包。
28.程序员都有哪些强迫症行为?
    乘电梯的时候看着电梯的按钮面板（UI）常常会开始思考电梯的调度算法，然后仔细一想好像状态挺多的，多个实例之间状态可以互相影响，还涉及到一些优先级、加速度、预判方面的东西，仔细想想其实挺复杂的，然后还没等到出电梯就放弃了。然后不知道哪次坐又会望着面板开始想。
29.发呆是一种生理需求吗?
    其实是删除缓存文件加整理磁盘碎片
30.什么时候感觉过你的心是凉的?
    文件没保存
31.如何回复程序员发来的短信：「Hello world」?
    hello nerd.
32.程序员的鄙视链是什么?
    老婆漂亮的程序员，鄙视老婆不漂亮的程序员。有老婆的程序员，鄙视没有老婆的程序员。没有老婆有女朋友的程序员，鄙视单身程序狗。在单身狗之间，才有语言、编辑器和操作系统的互相鄙视。
33.程序员女朋友如何给程序员男朋友过生日?
    告诉他，接口已经准备好了。
34.女票允许我出轨，并且还介绍她闺密给我认识。在她真的很爱我的前提下，该如何理解她的行为?
    千万不要上当！！！Mac告诉你，我也可以装windows哦，但你真的装了，会用高发热来报复你的！
35.分手100天了，还没有走出来怎么办?
    替换文件永远比删除文件更彻底。
36.程序员夫妻结婚戒指刻什么字好?
    0 error 0 warning
37. 乞求代码没有bug，该拜哪个神仙?
    拜雍正，专治八阿哥。
38.产品死了，如何安葬?
    开源。娱乐相关
39.《微微一笑很倾城》中的大四刚毕业的计算机水平是现实中能够达到的吗?电视剧中肖奈精通软件制作（这是小case了），精通黑客技术（打破世界级比赛记录），写的了游戏引擎（领先业内水平），精通算法优化。我也是IT刚毕业学生，前端er一枚。说实话整个剧中被肖奈的水平震惊了，连女演员好不好看都顾不得了。且不说剧情，这个水平是一个大四学生能够具备的吗。我对自己产生了深深的怀疑。（1）你怎么不问男主的长相是一个大四学生所具备的吗。（2）大四有这个技术水平的，肯定没有那么多头发。
40.为什么圣斗士每次出招前都要大喊一声招式?
    函数要先声明，然后才能调用。
41.为何诸葛亮常年拿一个羽毛扇?
    跟CPU上必须装风扇是一个道理。
42.苹果是宗教吗?
    是！并且教内有这样一个传说：任何人只要卖两个肾去买iphone就能见到教主。
43.罗永浩提出的锤子超过苹果的时间表大概是怎么样的?
    家祭无忘告乃翁。
44.你好，给我来2147483647.356个肉夹馍，2147483647个只要肉并且只有自己有食用权限，当别人尝试吃他们之前会默认得口腔溃疡并且馍上自动生成辣椒，另外0.256个只要馍，最后0.1个我要夹，夹和馍放一起，中间再加一条狗，狗的毛色要根据当前馍的温度自动转换，负五分钟后我会用微信扫一下你的支付宝付款码付款，我脑补了一下这应该很简单，我中午六点七十五分的时候来拿，谢谢
45.一个函数, 两眼看瞎, 三日无门, 四处调用, 五个分层, 六重迭代, 七人经手, 八种风格, 九类场景, 十分复杂, 百口莫辩, 千行代码, 万条线索, 亿级数据, 零行注释, 如看天书. 后占一卦, 改得一行, 鸡飞狗跳, 天地变色, db爆炸, 财务乱套, 公司割肉, 辞退归家, 前人挖坑, 后人跳海, 纵有大能, 焉出屎山? 惶惶终日, 两鬓斑白, 愤然归家, 种豆南山.
46.金角大王将宝葫倒置，喊了一声：“孙行者！”
悟空应了一声，嗖地被吸了进去。
金角大王查看葫芦，发现里面除了悟空，还有行者武松，孙权，六耳猕猴，金刚......
金角大王惊讶道：“只叫了孙行者，怎得来了这么多？”
这是宝葫芦开口回答：“这些都是你可能感兴趣的人”
	——可怕的互联网大数据
47.如何下次礼貌的反驳面试官“前端不过只是个写页面，向后端拿接口的嘛，你能讲讲项目中其他亮点吗”
	如果您仅仅指的是功能的话，那的确是这样。
	但是那些傻逼用户不仅要功能，还他妈要体验。
	什么加载超过3秒就离开页面，真他妈没耐心。
	什么输入的时候要给他自动填充，真他妈矫情。
	什么数据量一大页面卡顿抱怨，卡顿不会换更好的设备，这种穷逼还配成为我们公司的用户？
	这个世界因为这种垃圾用户太多了。
	伺候得了的叫全栈，伺候不了的叫后端，专门伺候的叫前端
